In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_excel('./tsp_(중구, 23, 17-21).xlsx', sheet_name='k=5')
df

  cluster  number                                 tsp route  distance
0       A       2                                   1, 2, 1  1.808901
1       B       4                             1, 2, 3, 4, 1  3.555046
2       C       8                 1, 2, 8, 4, 5, 7, 6, 3, 1  6.004443
3       D      12  1, 2, 4, 10, 8, 12, 11, 9, 5, 6, 7, 3, 1  3.597962
4       E       7                    1, 2, 3, 5, 6, 7, 4, 1  3.372025

In [3]:
#n : cluster 내 대여소 갯수
for i in range(len(df)):
    n=df.iloc[i, 1]
    d=df.iloc[i, 3]
    if n>=10:
        비용1=(d/6.8)*1332.74 + 23013.75*4 + 51450000/(16.8*365*2)
        df.loc[i,'truck type']='2.5t'
        df.loc[i, 'cost']=비용1
    else: 
        비용2=(d/8.5)*1332.74 + 23013.75*4 + 18375000/(16.8*365*2)
        df.loc[i,'truck type']='1.0t'
        df.loc[i, 'cost']=비용2
df

,cluster,number,tsp route,distance,truck type,cost
0,A,2,"1, 2, 1",1.808901,1.0t,93836.910605
1,B,4,"1, 2, 3, 4, 1",3.555046,1.0t,94110.693789
2,C,8,"1, 2, 8, 4, 5, 7, 6, 3, 1",6.004443,1.0t,94494.741916
3,D,12,"1, 2, 4, 10, 8, 12, 11, 9, 5, 6, 7, 3, 1",3.597962,2.5t,96955.374238
4,E,7,"1, 2, 3, 5, 6, 7, 4, 1",3.372025,1.0t,94081.997313

In [4]:
#total distance
a=0
for i in range(len(df)):
    a+=df.loc[i, 'distance']
a

18.33837622635818

In [5]:
#total cost
b=0
for i in range(len(df)):
    b+=df.loc[i, 'cost']
b

473479.71786095924